<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork928-2023-01-01">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

# **Collecting Job Data Using APIs**

### Objective: Determine the number of jobs currently open for various technologies  and for various locations
You have to execute the "Part_1_Jobs_API_Implementation.ipynb" Implementation code so that the client application **Collecting Jobs API**  will be accessing this code executing on the server.

Collect the number of job postings for the following locations using the API:

* Los Angeles
* New York
* San Francisco
* Washington DC
* Seattle
* Austin
* Detroit

In [1]:
#Import required libraries
import pandas as pd
import json
import requests
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (3.1.3)
Requirement already satisfied: et-xmlfile in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from openpyxl) (1.1.0)

#### Function to get the number of jobs for the Python technology :<br>
  
 ##### The keys in the json are 
 * Job Title
 
 * Job Experience Required
 
 * Key Skills
 
 * Role Category
 
 * Location
 
 * Functional Area
 
 * Industry
 
 * Role

In [2]:
api_url="http://127.0.0.1:5000/data"
def get_number_of_jobs_T(technology):
    number_of_jobs = 0
    payload={"Key Skills":technology}
    r=requests.get(api_url,params=payload)
    if r.ok:
        data = r.json()
        number_of_jobs += len(data)
    return number_of_jobs

Calling the function for Python and checking if it works.

In [3]:
get_number_of_jobs_T("Python")

1173

#### Function to get the number of jobs in US for a location :

In [4]:
api_url="http://127.0.0.1:5000/data"
def get_number_of_jobs_L(location):
    number_of_jobs = 0
    payload={"Location":location}
    r=requests.get(api_url,params=payload)
    if r.ok:
        data = r.json()
        number_of_jobs += len(data)
    return location, number_of_jobs

Call the function for Los Angeles and check if it is working.

In [5]:
get_number_of_jobs_L("Los Angeles")

('Los Angeles', 640)

### Storing the results in an excel file

Create a python list of all locations for which you need to find the number of jobs postings.

In [6]:
cities = ['Los Angeles', 'New York', 'San Francisco', 'Washington DC', 'Seattle', 'Austin', 'Detroit']

Import libraries required to create excel spreadsheet

In [7]:
from openpyxl import Workbook        # import Workbook class from module openpyxl

Creating a workbook and select the active worksheet

In [8]:
wb=Workbook()                        # create a workbook object
ws=wb.active                         # use the active worksheet
ws.append(['Location', 'Number of Job Postings'])

Finding the number of jobs postings for each of the location in the above list.
Then, writing the Location name and the number of jobs postings into the excel spreadsheet.

In [9]:
def get_number_of_jobs_TL(countries):
    number_of_jobs_list = []
    for location in countries:
        payload={"Location": location}
        response=requests.get(api_url, params=payload)
        if response.ok:
            data=response.json()
            number_of_jobs = len(data)
            number_of_jobs_list.append(number_of_jobs)
    return number_of_jobs_list
    return ws.append(number_of_jobs_list)

data = get_number_of_jobs_TL(cities)
df_data = pd.DataFrame(data, cities)
df_data

                  0
Los Angeles     640
New York       3226
San Francisco   435
Washington DC  5316
Seattle        3375
Austin          434
Detroit        3945

Save into an excel spreadsheet named 'job-postings.xlsx'.

In [10]:
file_name = "job-postings.xlsx"
df_data.to_excel(file_name)
print("Dataframe is written to Excel")

Dataframe is written to Excel

#### In the similar way, for below given technologies, results store in an excel sheet :

Collect the number of job postings for the following languages using the API:

*   C
*   C#
*   C++
*   Java
*   JavaScript
*   Python
*   Scala
*   Oracle
*   SQL Server
*   MySQL Server
*   PostgreSQL
*   MongoDB

In [11]:
technologies = ['C', 'C#', 'C++', 'Java', 'JavaScript', 'Python', 'Scala', 'Oracle', 'SQL Server', 'MySQL Server','PostgreSQL','MongoDB']

def get_number_of_jobs_TL(technologies, cities):
    final_list = []
    for technology in technologies:
        number_of_jobs_list = [technology]
        for location in cities:
            payload={"Key Skills": technology, "Location": location}
            response=requests.get(api_url, params=payload)
            if response.ok:
                data=response.json()
                number_of_jobs = len(data)
                number_of_jobs_list.append(number_of_jobs)
#         print(number_of_jobs_list)
        final_list.append(number_of_jobs_list)
    return final_list

get_number_of_jobs_TL(technologies, cities)

[['C', 296, 1622, 214, 2664, 1668, 224, 1973],
 ['C#', 5, 41, 3, 68, 49, 5, 60],
 ['C++', 3, 43, 3, 55, 41, 4, 32],
 ['Java', 43, 326, 38, 516, 354, 32, 353],
 ['JavaScript', 7, 51, 7, 61, 52, 5, 41],
 ['Python', 24, 143, 17, 258, 133, 15, 170],
 ['Scala', 0, 8, 0, 3, 4, 1, 5],
 ['Oracle', 17, 95, 19, 143, 110, 11, 115],
 ['SQL Server', 3, 36, 2, 53, 31, 5, 34],
 ['MySQL Server', 0, 0, 0, 0, 0, 0, 0],
 ['PostgreSQL', 0, 1, 0, 3, 1, 0, 2],
 ['MongoDB', 2, 25, 2, 32, 21, 1, 25]]

In [12]:
data = get_number_of_jobs_TL(technologies, cities)
df_data = pd.DataFrame(data, columns=['Technology', 'Los Angeles', 'New York', 'San Francisco', 'Washington DC', 'Seattle', 'Austin', 'Detroit'])
df_data

,Technology,Los Angeles,New York,San Francisco,Washington DC,Seattle,Austin,Detroit
0,C,296,1622,214,2664,1668,224,1973
1,C#,5,41,3,68,49,5,60
2,C++,3,43,3,55,41,4,32
3,Java,43,326,38,516,354,32,353
4,JavaScript,7,51,7,61,52,5,41
5,Python,24,143,17,258,133,15,170
6,Scala,0,8,0,3,4,1,5
7,Oracle,17,95,19,143,110,11,115
8,SQL Server,3,36,2,53,31,5,34
9,MySQL Server,0,0,0,0,0,0,0
10,PostgreSQL,0,1,0,3,1,0,2
11,MongoDB,2,25,2,32,21,1,25

In [13]:
file_name = "job-postings-tech.xlsx"
df_data.to_excel(file_name)
print("Dataframe is written to Excel")

Dataframe is written to Excel

Copyright Â© 2022 IBM Corporation. All rights reserved.